Revit 2027 API
BasicLossFactor(Double) Constructor
 Creates a basic loss factor object with the given value.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BasicLossFactor(
	double lossFactorIn
)
Public Sub New (
	lossFactorIn As Double
)
public:
BasicLossFactor(
	double lossFactorIn
)
new :
        lossFactorIn : float -> BasicLossFactor
Parameters
lossFactorIn Double
 The loss factor as a numerical value between 0.0 and 4.0
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The loss factor is not valid because it is not between 0.0 and 4.0.
See Also
Reference
BasicLossFactor Class
BasicLossFactor Overload
Autodesk.Revit.DB.Lighting Namespace